class CAH:
    transcript = {
        1: ("CPYE", "3"),
        2: ("CPYE", "2"),
        3: ("CPYE", "1"),
        4: ("ctdd", "0"),
        5: ("mRCV", "1"),
        6: ("mRCV", "2"),
        7: ("mRCV", "3"),
    }

    text_interpretation_1 = 'Человек, у которого преобладает негативная оценка своего состояния.'
    text_interpretation_2 = 'Человек, у которого доминирует неустойчивая оценка своего состояния или который сам не может оценить свое состояние как хорошее или плохое.'
    text_interpretation_3 = 'Человек, у которого чаще всего доминирует положительная оценка своего состояния.'

    answers_2_example = [2, 3, 5, 5, 5, 4, 2, 3, 4, 2, 3, 3, 6, 4, 6, 4, 5, 5, 5, 4, 3, 2, 2, 5, 5, 4, 5, 5, 5, 5] # 4 балов
    answers_3_max_210 = [1, 1, 7, 7, 1, 1, 1, 1, 7, 7, 1, 1, 1, 1, 7, 7, 1, 1, 1, 1, 7, 7, 1, 1, 1, 1, 7, 7, 1, 1] # 7 балов
    answers_1_min_30 = [7, 7, 1, 1, 7, 7, 7, 7, 1, 1, 7, 7, 7, 7, 1, 1, 7, 7, 7, 7, 1, 1, 7, 7, 7, 7, 1, 1, 7, 7] # 1 балов

    answers_1_34 = [7, 7, 1, 1, 7, 7, 7, 7, 1, 1, 7, 7, 7, 7, 1, 1, 7, 7, 7, 7, 1, 1, 7, 7, 7, 7, 1, 4, 7, 6] # 1.1 балов
    answers_1_60 = [7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 1, 7, 7, 7, 7, 1, 1, 7, 7, 7, 7, 1, 1, 7, 7] # 2 балов
    answers_1_90 = [1, 1, 7, 7, 1, 1, 1, 7, 7, 7, 7, 7, 7, 7, 7, 1, 7, 7, 7, 7, 1, 1, 7, 7, 7, 7, 1, 1, 7, 7] # 3 балов
    answers_1_96 = [4, 4, 7, 7, 1, 1, 1, 1, 7, 7, 1, 7, 7, 7, 7, 1, 7, 7, 7, 7, 1, 1, 7, 7, 7, 7, 1, 1, 7, 7] # 3.2 балов
    answers_2_99 = [1, 4, 7, 7, 1, 1, 1, 1, 7, 7, 1, 7, 7, 7, 7, 1, 7, 7, 7, 7, 1, 1, 7, 7, 7, 7, 1, 1, 7, 7] # 3.3 балов
    answers_2_102 = [1, 1, 7, 7, 1, 1, 1, 1, 7, 7, 1, 7, 7, 7, 7, 1, 7, 7, 7, 7, 1, 1, 7, 7, 7, 7, 1, 1, 7, 7] # 3.4 балов
    answers_2_105 = [1, 1, 7, 7, 1, 1, 1, 1, 7, 7, 4, 7, 7, 7, 7, 1, 7, 7, 7, 7, 1, 1, 7, 7, 7, 7, 1, 1, 7, 7] # 3.5 балов
    answers_2_120 = [4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4] # 4 балов
    answers_2_135 = [4, 4, 1, 4, 4, 4, 4, 4, 7, 7, 4, 4, 4, 4, 7, 7, 4, 4, 4, 4, 7, 7, 4, 4, 4, 4, 7, 4, 4, 4] # 4.5 балов
    answers_2_138 = [4, 4, 1, 7, 4, 4, 4, 4, 7, 7, 4, 4, 4, 4, 7, 7, 4, 4, 4, 4, 7, 7, 4, 4, 4, 4, 7, 4, 4, 4] # 4.6 балов
    answers_3_144 = [4, 4, 7, 7, 4, 4, 4, 4, 7, 7, 4, 4, 4, 4, 7, 7, 4, 4, 4, 4, 7, 7, 4, 4, 4, 4, 7, 4, 4, 4] # 4.8 балов
    answers_3_150 = [4, 4, 7, 7, 4, 4, 4, 4, 7, 7, 4, 4, 4, 4, 7, 7, 4, 4, 4, 4, 7, 7, 4, 4, 4, 4, 7, 7, 4, 4] # 5 балов

