class OKO:
    transcript = {
        1: ('j4Hb', "Никогда"),
        2: ('j4Hb', "Иногда"),
        3: ('j4Hb', "Часто"),
        4: ('j4Hb', "Всегда")
    }

    interpretations = {
        # 'text_interpretation_1': ('', ''),
        # 'text_interpretation_2': ('', ''),
        # 'text_interpretation_3': ('', ''),
        'text_interpretation_4': ('Ранимость', 'Ранимость.Выраженная чувствительность к критике, '
                                               'уязвимость в отношении замечаний и намеков на негативную '
                                               'оценку со стороны окружающих, ощущение несправедливого '
                                               'отношения к себе. '),
        'text_interpretation_5': ('Катастрофизация', 'Катастрофизация.Склонность преувеличивать значимость'
                                                     ' проблем и бурно на них реагировать, как правило, '
                                                     'вследствие прямого столкновения идеализированных представлений '
                                                     'о себе и окружающих с реальностью. Проявления: обостренное, '
                                                     'негативно преувеличенное реагирование на проблемы, выражающееся '
                                                     'в нереалистичном ожидании угрозы жизни, здоровью, благосостоянию,'
                                                     ' общественному статусу, в потере доверия и уверенности в '
                                                     'обмане со стороны других; склонность к аффективно-шоковым '
                                                     'и диссоциативным реакциям.'),
        # 'text_interpretation_6': ('', ''),
        # 'text_interpretation_7': ('', ''),
        # 'text_interpretation_8': ('', '')
    }


    answer_0_min = [1, # 1
                  1, # 2
                  1, # 3
                  1, # 4
                  1, # 5
                  1, # 6
                  1, # 7
                  1, # 8
                  1, # 9
                  1, # 10
                  1, # 11
                  1, # 12
                  1, # 13
                  1, # 14
                  1, # 15
                  1, # 16
                  1, # 17
                  1, # 18
                  1, # 19
                  1, # 20
                  1, # 21
                  1, # 22
                  1, # 23
                  1, # 24
                  1, # 25
                  1, # 26
                  1, # 27
                  1, # 28
                  1, # 29
                  1, # 30
                  1, # 31
                  1, # 32
                  1, # 33
                  1, # 34
                  4, # 35
                  1, # 36
                  1, # 37
                  1, # 38
                  1, # 39
                  1, # 40
                  1, # 41
                  1, # 42
                  1, # 43
                  1, # 44
                  1, # 45
                 ]

    answer_all_max = [4, # 1
                  4, # 2
                  4, # 3
                  4, # 4
                  4, # 5
                  4, # 6
                  4, # 7
                  4, # 8
                  4, # 9
                  4, # 10
                  4, # 11
                  4, # 12
                  4, # 13
                  4, # 14
                  4, # 15
                  4, # 16
                  4, # 17
                  4, # 18
                  4, # 19
                  4, # 20
                  4, # 21
                  4, # 22
                  4, # 23
                  4, # 24
                  4, # 25
                  4, # 26
                  4, # 27
                  4, # 28
                  4, # 29
                  4, # 30
                  4, # 31
                  4, # 32
                  4, # 33
                  4, # 34
                  1, # 35
                  4, # 36
                  4, # 37
                  4, # 38
                  4, # 39
                  4, # 40
                  4, # 41
                  4, # 42
                  4, # 43
                  4, # 44
                  4, # 45
                 ]

    answer_0_less_limit = [2, # 1
                  2, # 2
                  2, # 3
                  2, # 4
                  2, # 5
                  1, # 6
                  1, # 7
                  2, # 8
                  2, # 9
                  3, # 10
                  1, # 11
                  2, # 12
                  2, # 13
                  2, # 14
                  2, # 15
                  2, # 16
                  2, # 17
                  2, # 18
                  2, # 19
                  2, # 20
                  1, # 21
                  1, # 22
                  2, # 23
                  2, # 24
                  2, # 25
                  2, # 26
                  2, # 27
                  2, # 28
                  2, # 29
                  2, # 30
                  2, # 31
                  2, # 32
                  2, # 33
                  2, # 34
                  3, # 35
                  2, # 36
                  2, # 37
                  2, # 38
                  2, # 39
                  2, # 40
                  2, # 41
                  2, # 42
                  2, # 43
                  2, # 44
                  2, # 45
                ]

    answer_all_limit = [2, # 1
                2, # 2
                3, # 3
                3, # 4
                2, # 5
                1, # 6
                1, # 7
                2, # 8
                2, # 9
                3, # 10
                1, # 11
                2, # 12
                3, # 13
                3, # 14
                2, # 15
                2, # 16
                2, # 17
                2, # 18
                2, # 19
                2, # 20
                2, # 21
                1, # 22
                2, # 23
                2, # 24
                2, # 25
                2, # 26
                3, # 27
                3, # 28
                2, # 29
                2, # 30
                2, # 31
                2, # 32
                2, # 33
                2, # 34
                3, # 35
                2, # 36
                2, # 37
                2, # 38
                2, # 39
                2, # 40
                3, # 41
                2, # 42
                2, # 43
                2, # 44
                2, # 45
                 ]
