transcript = {
    1: ("CPYE", "3"),
    2: ("CPYE", "2"),
    3: ("CPYE", "1"),
    4: ("ctdd", "0"),
    5: ("mRCV", "1"),
    6: ("mRCV", "2"),
    7: ("mRCV", "3"),
}

text_interpretation_1 = 'Человек, у которого преобладает негативная оценка своего состояния'
text_interpretation_2 = 'Человек, у которого доминирует неустойчивая оценка своего состояния или который сам не может оценить свое состояние как хорошее или плохое.'
text_interpretation_3 = 'Человек, у которого чаще всего доминирует положительная оценка своего состояния.'



interpretation_2_example = [2, 3, 5, 5, 5, 4, 2, 3, 4, 2, 3, 3, 6, 4, 6, 4, 5, 5, 5, 4, 3, 2, 2, 5, 5, 4, 5, 5, 5, 5]
interpretation_2_120 = [4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4]
interpretation_3_max_210 = [1, 1, 7, 7, 1, 1, 1, 1, 7, 7, 1, 1, 1, 1, 7, 7, 1, 1, 1, 1, 7, 7, 1, 1, 1, 1, 7, 7, 1, 1]
interpretation_1_min_30 = [7, 7, 1, 1, 7, 7, 7, 7, 1, 1, 7, 7, 7, 7, 1, 1, 7, 7, 7, 7, 1, 1, 7, 7, 7, 7, 1, 1, 7, 7]

# interpretation_2_31 = [7, 7, 1, 1, 7, 7, 7, 7, 1, 1, 7, 7, 7, 7, 1, 1, 7, 7, 7, 7, 1, 1, 7, 7, 7, 7, 1, 1, 7, 6] # ------ ошибочный итог text_interpretation_1
# interpretation_2_35 = [7, 7, 1, 1, 7, 7, 7, 7, 1, 1, 7, 7, 7, 7, 1, 1, 7, 7, 7, 7, 1, 1, 7, 7, 7, 7, 1, 1, 7, 2]
# interpretation_2_45 = [7, 7, 1, 1, 7, 7, 7, 7, 1, 1, 7, 7, 7, 7, 1, 1, 7, 7, 7, 7, 1, 1, 7, 7, 7, 7, 1, 6, 2, 2]
# interpretation_3_46 = [7, 7, 1, 1, 7, 7, 7, 7, 1, 1, 7, 7, 7, 7, 1, 1, 7, 7, 7, 7, 1, 1, 7, 7, 7, 7, 1, 6, 2, 1]
# interpretation_3_50 = [7, 7, 1, 1, 7, 7, 7, 7, 1, 1, 7, 7, 7, 7, 1, 1, 7, 7, 7, 7, 1, 1, 7, 7, 7, 7, 6, 6, 2, 2]
# interpretation_3_70 = [7, 7, 1, 1, 7, 7, 7, 7, 1, 1, 7, 7, 7, 7, 1, 1, 7, 7, 7, 7, 1, 1, 2, 2, 2, 2, 6, 6, 2, 2]
# interpretation_3_71 = [7, 7, 1, 1, 7, 7, 7, 7, 1, 1, 7, 7, 7, 7, 1, 1, 7, 7, 7, 7, 1, 1, 2, 2, 2, 2, 6, 6, 2, 1]
# В экселе ошибочный диапазон
